## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ last_modified                  = "2024-04-09T01:51:05.187+0000" -> "2024-04-09T01:51:19.849+0000"
        # (23 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:78" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:78" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a2e3a4c8407c41b085f4a05fe489900f56c24dda6e2f27f3d359280ca31cf49f" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a5a19fc92da378860d1aa12ba574c9408428d6b305001b6e5ad420ddfb6ee23e"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 78 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "6504ec6433ddb45673063fe465c6dc4d-6" -> "1d3fd0f3db4f66fe2ce5bc04f4f8d75c"
        id                     = "graphql.1d3fd0f3db4f66fe2ce5bc04f4f8d75c.zip"
        tags                   = {}
      ~ version_id             = "ai0XKaj85.b0LkvicglYb7kOg3KwlDrQ" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = "L5pcvbPphyNymRNsNqhoHGxeVgA.x9eF" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.006f82f6307be0672e2813dfcd037d44.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e05a449dbe43077db89eeb72dea365c0-4" -> "080299f752157cfc2a6d20d2c95424d3"
      ~ id                     = "python.006f82f6307be0672e2813dfcd037d44.zip" -> (known after apply)
      ~ key                    = "python.006f82f6307be0672e2813dfcd037d44.zip" -> "python.080299f752157cfc2a6d20d2c95424d3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "006f82f6307be0672e2813dfcd037d44" -> "080299f752157cfc2a6d20d2c95424d3"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "7IDE0bQ6EHPtX_kqIsCYQbZa7sFNy6je" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3737c52a5488056727aae6c86e8204c9" -> "b636eda03410b55106c6e568dfee1283"
        id                     = "dist/200.html"
      ~ source_hash            = "3737c52a5488056727aae6c86e8204c9" -> "b636eda03410b55106c6e568dfee1283"
        tags                   = {}
      ~ version_id             = "Ag0RHiYYQ_lSJt2jYYWA6sDnuhmAqSyJ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a843ba56cbd7881551b2f84facf0ae30" -> "dd0548e8da296f6a12268c0241b35f6b"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "a843ba56cbd7881551b2f84facf0ae30" -> "dd0548e8da296f6a12268c0241b35f6b"
        tags                   = {}
      ~ version_id             = "sRM4cC00Cx1CdevHAI2hs5OkoZy_vePt" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a59f7cd3a98cec59be9aa2c388a2e984" -> "0f503a99c2a21e4a516e3b72c819a3a7"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "a59f7cd3a98cec59be9aa2c388a2e984" -> "0f503a99c2a21e4a516e3b72c819a3a7"
        tags                   = {}
      ~ version_id             = "3JtcLUBt_U1OZfonsX6tu7RaQeABnria" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3737c52a5488056727aae6c86e8204c9" -> "b636eda03410b55106c6e568dfee1283"
        id                     = "dist/index.html"
      ~ source_hash            = "3737c52a5488056727aae6c86e8204c9" -> "b636eda03410b55106c6e568dfee1283"
        tags                   = {}
      ~ version_id             = "fowYpkARAa_JOsX8Ur0HVyDmM_fgD18Z" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js"] will be destroyed
  # (because key ["static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "81ba79082ffa0add7653765ed28b5dc1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js" -> null
-       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js" -> null
-       source_hash            = "81ba79082ffa0add7653765ed28b5dc1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "SdyN0IzEKuQ3CN9HovxD_5STD9tun8R2" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "6d03c728fab30aebeef8d15c077f7d8c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.0af7186b.chunk.js.LICENSE.txt" -> null
-       source_hash            = "6d03c728fab30aebeef8d15c077f7d8c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "50qjHxV8TVsGs6jmHtkrnGZsa3OnrBt3" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "620019d5f4290b5bfd4436676a4231a7"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js"
+       source_hash            = "620019d5f4290b5bfd4436676a4231a7"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "6d03c728fab30aebeef8d15c077f7d8c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt"
+       source_hash            = "6d03c728fab30aebeef8d15c077f7d8c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.13f99893.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d3731dd001084a6bf362918a8396cfca"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.13f99893.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.13f99893.chunk.js"
+       source_hash            = "d3731dd001084a6bf362918a8396cfca"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "efea1edc51440599026956ce53a048e0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt"
+       source_hash            = "efea1edc51440599026956ce53a048e0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.a2d9a793.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadPage.a2d9a793.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.a2d9a793.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "77d0f8028ee4cfaa746775d74d93a60c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.a2d9a793.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadPage.a2d9a793.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.a2d9a793.chunk.js" -> null
-       source_hash            = "77d0f8028ee4cfaa746775d74d93a60c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "c3nOcOsM5HPQ2PvhA9pw3kZIQgE4MeB_" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.a2d9a793.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadPage.a2d9a793.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.a2d9a793.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "efea1edc51440599026956ce53a048e0" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.a2d9a793.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadPage.a2d9a793.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.a2d9a793.chunk.js.LICENSE.txt" -> null
-       source_hash            = "efea1edc51440599026956ce53a048e0" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "HbiydBDpE5CoRAuGNvEKIU_TR5WBXLfj" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.2f4b826d.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.2f4b826d.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadsPage.2f4b826d.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "1c062f6118c930cd37eb46da26fd7655" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.2f4b826d.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.2f4b826d.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.2f4b826d.chunk.js" -> null
-       source_hash            = "1c062f6118c930cd37eb46da26fd7655" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "psIYdoZMDSVXW.CEr9YXXDGAMjAMryj9" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.2f4b826d.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.2f4b826d.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadsPage.2f4b826d.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "43ff778014632a7ef9766fd4374290b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.2f4b826d.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.2f4b826d.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.2f4b826d.chunk.js.LICENSE.txt" -> null
-       source_hash            = "43ff778014632a7ef9766fd4374290b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "8uLvlooFNoeywBnuByBp7f.snDx0c1rI" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.67e917bd.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "92ef10bbf36730b1d9900c21f23a3a36"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.67e917bd.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.67e917bd.chunk.js"
+       source_hash            = "92ef10bbf36730b1d9900c21f23a3a36"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.67e917bd.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "43ff778014632a7ef9766fd4374290b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.67e917bd.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.67e917bd.chunk.js.LICENSE.txt"
+       source_hash            = "43ff778014632a7ef9766fd4374290b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a4e88496.js"] will be destroyed
  # (because key ["static/js/app.a4e88496.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.a4e88496.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9ba20efd0ccc14f9c4b491b319329940" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a4e88496.js" -> null
-       key                    = "dist/static/js/app.a4e88496.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a4e88496.js" -> null
-       source_hash            = "9ba20efd0ccc14f9c4b491b319329940" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "VYUXF_FDYPaE1b5QC7I06juEo5er16i2" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a4e88496.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.a4e88496.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.a4e88496.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a4e88496.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.a4e88496.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a4e88496.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "D0GEGZKINtSQxUvhgbXFe3H35B_.pDg0" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.3600f6c1.js"] will be destroyed
  # (because key ["static/js/runtime-app.3600f6c1.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/runtime-app.3600f6c1.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8f36f32420a43bcbbe69b8a398b2b27e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.3600f6c1.js" -> null
-       key                    = "dist/static/js/runtime-app.3600f6c1.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.3600f6c1.js" -> null
-       source_hash            = "8f36f32420a43bcbbe69b8a398b2b27e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "l52_F06JvGV1Pt4GBuEsvlaPRk_7gHZO" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.5c269f87.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "0ad284bdb6e466eaf0a085de2407bc76"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.5c269f87.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.5c269f87.js"
+       source_hash            = "0ad284bdb6e466eaf0a085de2407bc76"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-09T01:51:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:45" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:45/invocations" -> (known after apply)
      ~ s3_key                         = "python.006f82f6307be0672e2813dfcd037d44.zip" -> "python.080299f752157cfc2a6d20d2c95424d3.zip"
        tags                           = {}
      ~ version                        = "45" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "f5231f462effe4c75afeca60c42d55deddefddb1" -> "e703610f2b07e8f27d034482c1af03076cdcef48"
              ~ "DD_TAGS"                      = "git.commit.sha:f5231f462effe4c75afeca60c42d55deddefddb1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:e703610f2b07e8f27d034482c1af03076cdcef48,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "f5231f462effe4c75afeca60c42d55deddefddb1" -> "e703610f2b07e8f27d034482c1af03076cdcef48"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "45" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:93" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:93/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "93" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "f5231f462effe4c75afeca60c42d55deddefddb1" -> "e703610f2b07e8f27d034482c1af03076cdcef48"
              ~ "DD_TAGS"                            = "git.commit.sha:f5231f462effe4c75afeca60c42d55deddefddb1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:e703610f2b07e8f27d034482c1af03076cdcef48,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "f5231f462effe4c75afeca60c42d55deddefddb1" -> "e703610f2b07e8f27d034482c1af03076cdcef48"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "93" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:1/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "f5231f462effe4c75afeca60c42d55deddefddb1" -> "e703610f2b07e8f27d034482c1af03076cdcef48"
              ~ "DD_TAGS"                      = "git.commit.sha:f5231f462effe4c75afeca60c42d55deddefddb1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:e703610f2b07e8f27d034482c1af03076cdcef48,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "f5231f462effe4c75afeca60c42d55deddefddb1" -> "e703610f2b07e8f27d034482c1af03076cdcef48"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 14 to add, 10 to change, 14 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8617209951)*